Revit 2027 API
FormattedText.GetListStartNumber Method
 Returns the list start number of the paragraphs in a given text range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetListStartNumber(
	TextRange textRange
)
Public Function GetListStartNumber (
	textRange As TextRange
) As Integer
public:
int GetListStartNumber(
	TextRange^ textRange
)
member GetListStartNumber :
        textRange : TextRange -> int
Parameters
textRange TextRange
 The given text range.
Return Value
Int32
 The list start number of the text range.
Exceptions
Exception | Condition
ArgumentException |  This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text.
ArgumentNullException |  A non-optional argument was null
Remarks
 Returns -1 if there is a mix of list start values in the range or if there are paragraphs in different lists or sub-lists in the range or if there are paragraphs of type None or Bullet in the range.
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace